{
    "TutorialSectionInformationList":
    [
        {
            "info":"<b><size=120%>Trivia</size></b>\n\nUm ein <color=#f7e7ce>\"Pin-Tumbler\"-Schloss</color> zu öffnen, muss der <color=#f1c232>Core</color> frei beweglich sein. Dies wird von den <color=#6fa8dc>Pin-Paaren</color> verhindert, welche in das <color=#f7e7ce>Schloss</color> eingesetzt und mit einer <color=#eafffb>Feder</color> in Position gehalten werden. Ein <color=#6fa8dc>Pin-Paar</color> besteht aus zwei <color=#6fa8dc>Pins</color>: Der <color=#9fc5e8>Key-Pin</color> liegt näher am <color=#f7e7ce>Schloss</color> und wird von den Zähnen des Schlüssels berührt. Der <color=#3d85c6>Driver-Pin</color> berührt hingegen die <color=#eafffb>Feder</color> und sitzt im ruhenden Zustand auf der <color=#f6b26b>Sheerline</color>, wodurch er die Bewegung des <color=#f1c232>Cores</color> verhindert.\n\nZum Öffnen des <color=#f7e7ce>Schlosses</color> müssen alle <color=#6fa8dc>Pin-Paare</color> auf die korrekte vertikale Position bewegt werden, sodass der Berührungspunkt der beiden <color=#6fa8dc>Pins</color> jedes Paares auf der <color=#f6b26b>Sheerline</color> liegt und der <color=#f1c232>Core</color> somit drehbar ist.",
            "label": "Schloss-Mechanismus",
            "pinCount": 5,
            "pinOrder": null,
            "respectOrder": false,
            "hasPick": false,
            "hasTension": false,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": true
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nEin Pick wird in das Schlüsselloch eingefügt, mit welchem die Pin-Paare manuell auf die gewünschte Position bewegt werden könnten. Wenn ein Pin-Paar in der richtigen Position sitzt und nicht mehr droht herunter zu fallen, nennt man den Status des Pin-Paares SET.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nDie Key-Pins müssen mit der Pick langsam in die korrekte Position bewegt werden, bis jedes Pin-Paar auf der Sheerline festsitzt.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Der Grund warum die Pins nicht wieder herunterfallen, wird im Folgenden genauer behandelt.\n\n> Oftmals ist das Innenleben eines Schlosses nur sehr schwierig zu navigieren. Im realen Nutzertest wird es sich lohnen, den Pick schräg anzuwinkeln um mit der gebogenen Spitze des Picks über die Key-Pins zu kommen.",
            "label": "Pick-Bewegung",
            "pinCount": 3,
            "pinOrder": null,
            "respectOrder": false,
            "hasPick": true,
            "hasTension": false,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nDer Druck der Feder verhindert, dass das Pin-Paar auf der Sheerline bleibt. Um dies zu umgehen wird mit einem Tension-Tool ein Winkeldruck auf den Core übertragen. Sobald ein Pin-Paar an der korrekten Position ist, kann der Core ein minimales Stück gedreht werden. Diese Drehung wird auch auf den Key-Pin innerhalb des Cores übertragen, wodurch dieser nicht mehr geradewegs auf den Driver-Pin fallen kann. Der Core hat das Pin-Paar damit voneinander getrennt und somit GESETTED.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nEin Tension-Indikator zeigt die derzeit genutzte Kraft auf das Tension-Tool an. Übermäßig viel Tension führt dazu, dass die Pins festgesetzt werden. Überhaupt keine Tension führt zu einer vollkommenen Befreiung aller bereits gesetteten Pins.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Die allerwichtigste Fähigkeit zum Lockpicking ist es, einen adequaten Druck auf das Tension-Tool anzuwenden. Die Regel für Anfänger ist hierbei: Nutze so wenig Druck wie möglich!\n\n> Ein gesetteter Driver-Pin ist vollkommen unbeweglich, da er von der Feder an ein kleines herausschauendes Stück des Cores gedrückt wird. Ein gesetteter Key-Pin ist jedoch frei beweglich und wird von Gravitation beeinflusst. Er ist aufgrund des geringen Gewichts jedoch nahezu nicht spürbar, selbst wenn er bewegt wird.",
            "label": "Tension",
            "pinCount": 3,
            "pinOrder": null,
            "respectOrder": false,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator":true,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nZu starke Tension setzt Pins fest und sollte deshalb vermieden werden. Besonders gefährlich sind dabei Oversets. Diese geschehen, wenn ein Pin-Paar unter die Sheerline, also zu weit, bewegt wird während zu starke Tension auf den Core wirkt. Dabei werden die Pins in dieser inkorrekten Position festgesetzt, was jeglichen Fortschritt hemmt und oftmals schwierig zu erkennen ist. Teilweise kann eine Verringerung der Tension das Problem lösen, manchmal muss jedoch jegliche Tension losgelassen werden und der Lockpicking-Prozess muss von erneut beginnen.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nHaptisches Feedback bietet einen Einblick in den Status der Tension, aber auch über die gesetteten Pins. Ein gesetteter Pin ist oftmals spürbar in Form von einem sehr kurzen Nachlass an Wiederstand. Wichtig ist weiterhin nur sehr wenig Druck anzuwenden, auch wenn dies die Stärke des haptischen Feedbacks verringert.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Wenn ein Schloss sich nicht öffnen lässt und man keinen Fortschritt mehr macht, lasse jegliche Tension los und wiggle mit dem Tension Tool das Schloss um sicherzustellen, dass es von jeglichen Oversets befreit ist. Nutze im darauf folgenden Versuch weniger Druck!",
            "label": "Haptische Tension",
            "pinCount": 3,
            "pinOrder": null,
            "respectOrder": false,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nFalls der Winkeldruck auf alle Pins gleichstark angewandt werden würde, könnte kein Pin je SETTEN, da der Core sich nicht bewegen könnte. Aufgrund von Ungenauigkeiten in der Schoss-Manufaktur wird die Tension auf den Core jedoch in einer per Schloss festgesetzten Reihenfolge auf die Pins angewandt. Der Status des Pin-Paars, welches den Hauptteil der Tension erfährt, wird als BINDING beschrieben. Die nicht betroffenen Pin-Paare sind hierbei SPRINGY. Sobald ein Binding-Pin-Paar gesetted ist, bindet ein neues Paar.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nDie Farbe der Pins zeigen, welche Pin-Paare BINDING und welche SPRINGY sind. Training kann es einem Lockpicker ermöglichen mit stärkerer Tension mehrere gleichzeitig bindende Pin zu forcieren. Dies ist in dieser Software nicht abgebildet, weshalb der Fokus weiterhin auf minimaler Tension liegen sollte.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Ein Schloss hat immer dieselbe Reihenfolge von Binding-Pins. Wenn man ein Schloss nicht öffnen kann, lohnt es sich, sich nach und nach die Reihenfolge zu erschließen. Wissen über ein Schloss zu erlangen ist ebenfalls Fortschritt!",
            "label": "Binding-Pins",
            "pinCount": 4,
            "pinOrder": [2, 0, 1, 3],
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": true,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nEin binding Pin-Paar ist durch eine erhöhte Resistenz und Schwerfälligkeit in der Bewegung bemerkbar. Ein gesettetes Pin-Paar ist hingegen vollständig unbeweglich.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nDie Schwerfälligkeit der Bewegung ist in der Software durch Vibration dargestellt. Sollte versucht werden ein gesettetes Key-Paar zu bewegen, wird sich der Pick in den Pin hinein bewegen, was eine starke Vibration auch am Handgelenk verursachen wird.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Wenn kein Pin ein binding Pin zu sein scheint und man keinen Fortschritt macht, könnte dies auf einen Overset hinweisen.\n\n> Oftmals settet man binding Pins ohne es zu bemerken. Besonders vordere Pins sind davon betroffen, da diese automatisch beim abtasten und setten hinterer Pins in einer Art Kettenreaktion gesettet werden können wenn der Pick-Hals sie in eine passende Position gebracht hat.\n\n> Gehe die Pins von vorne nach hinten oder hinten nach vorne durch und teste sie auf Binding Pins. Es ist wahrscheinlich, dass Anfänger Lockpicker Binding-Pins nicht gut von Springy Pins unterscheiden können. Eine Trial-And-Error Methodik zum testen welche Pins setten, funktioniert ähnlich gut.",
            "label": "Haptisches Pins",
            "pinCount": 4,
            "pinOrder": [3, 0, 2, 1],
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "FULL",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nBeim Lockpicking muss man sich auf das haptische Feedback verlassen um ein Schloss zu navigieren.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nDie 4 vordersten Pins müssen hier gesettet werden. Der Pick hat 5 Markierungen, welche man an das Schlüsselloch ausrichten kann um die exakte Position jedes Pins zu kennen. Da nur der Core nicht mehr einsichtbar ist, hilft die Bewegung der Driver-Pins um die Pick-Bewegungen zu deuten.",
            "label": "Verringerte Sichtbarkeit",
            "pinCount": 4,
            "pinOrder": null,
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":true,
            "cutoutState": "Partial",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Trivia</size></b></voffset>\nNeben haptischem, hilft außerdem auditives Feedback. Das Setten eines Pins macht oftmals ein metallisches Schnack-Geräusch, wenn ein Pin-Paar auseinander forciert wird. Ebenso macht nicht-gesettetes Pin-Paar ein Geräusch, wenn es von der Feder rapide in die Ausgangsposition gedrückt wird.\n\n<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nDie 4 vordersten Pins müssen hier gesetzt werden. Das Schloss ist in derselben Form, wie es auch im folgenden Nutzertest dargestellt sein wird. Bisher helfen die Markierungen noch um sich im Schloss zu orientieren.\n\n<voffset=0.25em><b><size=120%>Tipps</size></b></voffset>\n> Tippe mit dem Pick vor den ersten Key-Pin und bewege dich von dieser Position aus nach oben und greife den Pin mit der Spitze des Picks. Wiederhole dies für jeden Pin und du weißt immer exakt wo du dich im Schloss befindest.\n\n> Wenn du nicht weißt auf welchem Pin du mit der Pick bist, kannst du in einem langsamen, gleichmäßigen Tempo den Pick zurück in Richtung Schlüsselloch führen und hören wie jedes Pin-Paar von der Feder an die Ausgangsposition befördert wird. Damit kannst du die Pin-Anzahl zählen und hören welche Pins gesettet sind, da sie keinen Sound machen - sich also nicht zurückbewegen.",
            "label": "Keine Sichtbarkeit",
            "pinCount": 4,
            "pinOrder": null,
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator": false,
            "showPinPositionIndicator": true,
            "cutoutState": "NONE",
            "enableCustomization": false,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nHier kannst du nochmal mit allen Optionen herumspielen und dich mit dem System vertraut machen.\n\n<voffset=0.25em><b><size=120%>Die wichtigsten Tipps</size></b></voffset>\n> Oftmals ist das Innenleben eines Schlosses nur sehr schwierig zu navigieren. Im folgenden Nutzertest wird es sich lohnen, den Pick schräg anzuwinkeln um mit der gebogenen Spitze des Picks über die Key-Pins zu kommen.\n\n> Wenn ein Schloss sich nicht öffnen lässt und man keinen Binding Pin mehr findet, verringere die Tension. Falls das nicht funktioniert, lasse jegliche Tension los und wiggle mit dem Tension Tool das Schloss um sicherzustellen, dass es von jeglichen Oversets befreit ist. Nutze im darauf folgenden Versuch weniger Druck!\n\n> Ein Schloss hat immer dieselbe Reheinfolge von Binding-Pins. Wenn man ein Schloss nicht öffnen kann, lohnt es sich, sich nach und nach die Reihenfolge zu erschließen. Wissen über ein Schloss zu erlangen ist ebenfalls Fortschritt!",
            "label": "Experimente",
            "pinCount": 5,
            "pinOrder": null,
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": true,
            "showTensionIndicator":true,
            "showPinPositionIndicator":true,
            "cutoutState": "FULL",
            "enableCustomization": true,
            "keyAnimation": false
        },
        {
            "info": "<voffset=0.25em><b><size=120%>Software</size></b></voffset>\nWenn du dieses 5-Pin-Schloss öffnest, bist du bereit für den Nutzertest!",
            "label": "Finaler Test",
            "pinCount": 5,
            "pinOrder": null,
            "respectOrder": true,
            "hasPick": true,
            "hasTension": true,
            "colorCodePins": false,
            "showTensionIndicator":false,
            "showPinPositionIndicator":false,
            "cutoutState": "NONE",
            "enableCustomization": false,
            "keyAnimation": false
        }
    ]
}